bit-finance/Reports/бит_УдалитьОСВПоЗаписямТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УдалитьОСВПоЗаписямТрансляции</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПриемника</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериодаПриемника</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаЗаполненияПолей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ПравилаЗаполненияПолейПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ПравилаЗаполненияПолейПриТрансляции</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Приемник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПередФормированиемНабораЗаписей</Name>
					<Comment>Код, выполняющийся перед началом формирования набора записей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПередФормированиемЗаписи</Name>
					<Comment>Код, выполняющийся перед началом формирования записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПослеФормированияЗаписи</Name>
					<Comment>Код, выполняющийся после формирования записи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПослеФормированияНабораЗаписей</Name>
					<Comment>Код, выполняющийся после формирования набора записей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗаполнения</Name>
					<Comment>Код алгоритма заполнения </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_Статьи_СтатьиРегл</Name>
					<Comment>Использовать соответствие статей оборотов и  статей регл. учета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_Статьи_НомГруппы</Name>
					<Comment>Использовать соответствие статей оборотов и номенклатурных групп</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_Соответствие_ЦФО_Подразделения</Name>
					<Comment>Использовать соответствие ЦФО и подразделений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать_СинхронизациюПодразделенияЦФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринудительноеЗаполнениеВалютныхСумм</Name>
					<Comment>Принудительное заполнение валютных сумм</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводкиБюджетирования</Name>
					<Comment>Формировать проводки бюджетирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗависимыеОбороты</Name>
					<Comment>Формировать зависимые обороты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетМПЗпоИсторическойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетАвансовПоИсторическойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИспользованияСоответствий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыИспользованияСоответствийПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляИсточника</Name>
					<Comment>Поля источника</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляПриемника</Name>
					<Comment>Поля приемника</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоЗаполнения</Name>
							<Comment>Правило заполнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Comment>Обязательное</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеСоответствия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСоответствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_УдалитьОСВПоЗаписямТрансляции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

    //----------------------------------------------------------------------
	// Изменение текста запроса.
	ПриводитьПустойТипКНеопределено = бит_ОтчетыСервер.ПолучитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек,
										"ПриводитьПустойТипКНеопределено");
	СформироватьЗапрос(ПриводитьПустойТипКНеопределено);
    
    //----------------------------------------------------------------------
	// Параметры.	
	СписокПараметровНаФорме     = Новый СписокЗначений;
	СписокДополнительныхСвойств = Новый СписокЗначений;
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Отчеты[ИмяОтчета].ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме, СписокДополнительныхСвойств); 	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл  		
		ИмяПараметра = ЭлементСписка.Значение; 		
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);		
	КонецЦикла; 
	
	// Установка периода приемника.
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПериодПриемника.ДатаНачала) 
		 И НЕ ЗначениеЗаполнено(ЭтотОбъект.ПериодПриемника.ДатаОкончания) Тогда
		
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект.Период, 
																 "ПериодПриемника");		
		
	Иначе	
		
		
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект.ПериодПриемника, 
																 "ПериодПриемника");		
		
		
		
	КонецЕсли; 
		
	// Определим название для группировки в которой отображаются обороты по регистру бухгалтерии.
	ПараметрыСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	
	// Периодичность может быть Период или Регистратор. Если в группировках отсутствует группировка по регистратору, то
	// периодичность выставляем Период, т.к. иначе в остатках выводятся некорректные данные.
		
	Если ЕстьГруппировкаПоРегистратору() Тогда
		
		МассивПолей = Новый Массив;
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыРегл.СуммаРеглОборотДт"));
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыРегл.СуммаРеглОборотКт"));
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыУпр.СуммаУпрОборотДт"));
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыУпр.СуммаУпрОборотКт"));
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыМу.СуммаМуОборотДт"));
		МассивПолей.Добавить(Новый ПолеКомпоновкиДанных("ОборотыМу.СуммаМуОборотКт"));
		
		ИДВыбранныхПолей = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(КомпоновщикНастроек.Настройки.Выбор);
		
		ВыбранныеПоля = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьОбъектПоИдентификатору(ИДВыбранныхПолей);
		
		ОбработатьВыбранныеПоля(ВыбранныеПоля.Элементы, МассивПолей);
		
	КонецЕсли;
	
	ПараметрыСКД.УстановитьЗначениеПараметра("ПоВсемОрганизациям", НЕ ЗначениеЗаполнено(Организация));
	ПараметрыСКД.УстановитьЗначениеПараметра("РегистрИсточник"	 , ПравилаЗаполненияПолей.Источник);
	ПараметрыСКД.УстановитьЗначениеПараметра("РегистрПриемник"	 , ПравилаЗаполненияПолей.Приемник);
	Если ПриводитьПустойТипКНеопределено Тогда
		ПараметрыСКД.УстановитьЗначениеПараметра("ПустыеСсылки", ПустыеСсылки());
	КонецЕсли;
	
КонецПроцедуры // ПриКомпоновкеРезультата()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    // Текст запроса отличается в БП и SA.
	Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ПравилаЗаполненияПолей", ПравилаЗаполненияПолей);
    Запрос.УстановитьПараметр("ВидОбъекта"            , Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии);
    Запрос.Текст = "
    |ВЫБРАТЬ
    |	ПравилаЗаполнения.Ссылка КАК Ссылка,
    |	ОбъектыСистемы.ВидОбъекта
    |	
    |ИЗ
    |	Справочник.бит_ПравилаЗаполненияПолейПриТрансляции КАК ПравилаЗаполнения
    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_ОбъектыСистемы КАК ОбъектыСистемы
    |		ПО (ПравилаЗаполнения.Источник = ОбъектыСистемы.Ссылка
    |				ИЛИ ПравилаЗаполнения.Приемник = ОбъектыСистемы.Ссылка)
    |   ГДЕ
    |   ПравилаЗаполнения.Ссылка = &ПравилаЗаполненияПолей
    |   И ОбъектыСистемы.ВидОбъекта <> &ВидОбъекта
    |";
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда    	
    	ТекстСообщения = НСтр("ru = 'Указано не корректное правило заполнения полей. В отчете следует указать правило, в котором в качестве источника и приемника используется регистр бухгалтерии.'; 
		                      |en = 'An incorrect rule for filling in the fields is indicated. The report should indicate a rule in which the accounting register is used as the source and destination.'");
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,, "ПравилаЗаполненияПолей", Отказ);
    КонецЕсли;
    	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьГруппировкаПоРегистратору()
	
	ЕстьГруппировка = Ложь; 
	
	СтруктураВывода = КомпоновщикНастроек.Настройки.Структура;
	
	ПолеРегистратор = Новый ПолеКомпоновкиДанных("Регистратор");
	
	Для Каждого ТекЭлемент Из СтруктураВывода Цикл
		
		ПоляГруппировки = ТекЭлемент.ПоляГруппировки.Элементы;		
		Для Каждого ТекПоле Из ПоляГруппировки Цикл
			
			Если ТекПоле.Поле = ПолеРегистратор Тогда
				ЕстьГруппировка = Истина;				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат ЕстьГруппировка;
	
КонецФункции // ЕстьГруппировкаПоРегистратору ()

Процедура ОбработатьВыбранныеПоля(ВыбранныеПоля, МассивПолей)
	
	Для Каждого ТекПоле Из ВыбранныеПоля Цикл
		
		Если ТипЗнч(ТекПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			
			ОбработатьВыбранныеПоля(ТекПоле.Элементы, МассивПолей);
			
		Иначе
			
			НайденноеПоле = МассивПолей.Найти(ТекПоле.Поле);
			
			Если НайденноеПоле = Неопределено Тогда
				ТекПоле.Использование = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПустыеСсылки()
	
	ПустыеСсылки = Новый СписокЗначений;
	
	Для каждого Справочник Из Метаданные.Справочники Цикл
		ПустыеСсылки.Добавить(Справочники[Справочник.Имя].ПустаяСсылка());
	КонецЦикла;
	
	Для каждого Документ Из Метаданные.Документы Цикл
		ПустыеСсылки.Добавить(Документы[Документ.Имя].ПустаяСсылка());
	КонецЦикла;
	
	Для каждого Перечисление Из Метаданные.Перечисления Цикл
		ПустыеСсылки.Добавить(Перечисления[Перечисление.Имя].ПустаяСсылка());
	КонецЦикла;
	
	Возврат ПустыеСсылки;
	
КонецФункции

#Область ФормированиеТекстаЗапроса

Функция СформироватьТекстЗапросаПоРегистру(МетаРегистра, ИмяРегистра, ЭтоИсточник, ПриводитьПустойТипКНеопределено)
	
	КолвоСубконтоРегистра = МетаРегистра.ПланСчетов.МаксКоличествоСубконто;	
		
	ТекстВыборСубконтоОстатки = "";
	ТекстВыборСубконтоОбороты = "";
    ТекстВыборРесурсыОстатки  = "";
    ТекстВыборРесурсыОбороты  = "";
    
    ОкончаниеПеренос = ",
    |";
		
	Для Ном = 1 По 4 Цикл
        
        Окончание = ?(Ном = 4, "", ОкончаниеПеренос);
        
		Если Ном > КолвоСубконтоРегистра Тогда
			ТекстВыборСубконтоОстатки = ТекстВыборСубконтоОстатки + 
			"	НЕОПРЕДЕЛЕНО КАК Субконто" + Ном + Окончание;
            ТекстВыборСубконтоОбороты = ТекстВыборСубконтоОбороты + 
			"	НЕОПРЕДЕЛЕНО КАК Субконто" + Ном + Окончание;
		ИначеЕсли ПриводитьПустойТипКНеопределено Тогда
			ТекстВыборСубконтоОстатки = ТекстВыборСубконтоОстатки + 
			"	ВЫБОР
			|		КОГДА %ИмяТаблицы%ОстаткиПереопределяемый.Субконто" + Ном + " ЕСТЬ NULL
			|				ИЛИ %ИмяТаблицы%ОстаткиПереопределяемый.Субконто" + Ном + " В (&ПустыеСсылки)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ %ИмяТаблицы%ОстаткиПереопределяемый.Субконто" + Ном + "
			|	КОНЕЦ КАК Субконто" + Ном + Окончание;
			ТекстВыборСубконтоОбороты = ТекстВыборСубконтоОбороты +
			"	ВЫБОР
			|		КОГДА %ИмяТаблицы%ОборотыПереопределяемый.Субконто" + Ном + " ЕСТЬ NULL
			|				ИЛИ %ИмяТаблицы%ОборотыПереопределяемый.Субконто" + Ном + " В (&ПустыеСсылки)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ %ИмяТаблицы%ОборотыПереопределяемый.Субконто" + Ном + "
			|	КОНЕЦ КАК Субконто" + Ном + Окончание;
		Иначе
			ТекстВыборСубконтоОстатки = ТекстВыборСубконтоОстатки + 
			"	ЕСТЬNULL(%ИмяТаблицы%ОстаткиПереопределяемый.Субконто" + Ном + ", НЕОПРЕДЕЛЕНО) КАК Субконто" + Ном + Окончание;
			ТекстВыборСубконтоОбороты = ТекстВыборСубконтоОбороты + 
			"	ЕСТЬNULL(%ИмяТаблицы%ОборотыПереопределяемый.Субконто" + Ном + ", НЕОПРЕДЕЛЕНО) КАК Субконто" + Ном + Окончание;
		КонецЕсли;
				
    КонецЦикла;
    
	ИменаРесурсов = Новый СписокЗначений;
    Если ИмяРегистра = "Хозрасчетный" Тогда
        ИменаРесурсов.Добавить("Сумма"    , "СуммаРегл");
	Иначе	
        ИменаРесурсов.Добавить("СуммаРегл", "СуммаРегл");
    КонецЕсли;
	ИменаРесурсов.Добавить("СуммаУпр"     , "СуммаУпр");
	ИменаРесурсов.Добавить("СуммаМу"      , "СуммаМу");
    ИменаРесурсов.Добавить("СуммаСценарий", "СуммаСценарий", Истина);
	
	Для Каждого ЭлРесурс Из ИменаРесурсов Цикл
        
        ИмяРесурса     = ЭлРесурс.Значение;
        СинонимРесурса = ЭлРесурс.Представление; 
        
        Окончание = ?(ЭлРесурс.Пометка, "", ОкончаниеПеренос);
        
        НайденныйРесурс = МетаРегистра.Ресурсы.Найти(ИмяРесурса);
        
        Если НайденныйРесурс = Неопределено Тогда
            ТекстВыборРесурсыОстатки = ТекстВыборРесурсыОстатки + 
            "	0 КАК " + СинонимРесурса + "НачальныйОстатокДт,
            |   0 КАК " + СинонимРесурса + "НачальныйОстатокКт,
            |   0 КАК " + СинонимРесурса + "КонечныйОстатокДт,
            |   0 КАК " + СинонимРесурса + "КонечныйОстатокКт" + Окончание;
            ТекстВыборРесурсыОбороты = ТекстВыборРесурсыОбороты + 
            "	0 КАК " + СинонимРесурса + "ОборотДт,
            |	0 КАК " + СинонимРесурса + "ОборотКт" + Окончание;
        Иначе
            ТекстВыборРесурсыОстатки = ТекстВыборРесурсыОстатки + 
            "	ЕСТЬNULL(%ИмяТаблицы%ОстаткиПереопределяемый." + ИмяРесурса + "НачальныйОстатокДт, 0) КАК " + СинонимРесурса + "НачальныйОстатокДт,
            |   ЕСТЬNULL(%ИмяТаблицы%ОстаткиПереопределяемый." + ИмяРесурса + "НачальныйОстатокКт, 0) КАК " + СинонимРесурса + "НачальныйОстатокКт,
            |   ЕСТЬNULL(%ИмяТаблицы%ОстаткиПереопределяемый." + ИмяРесурса + "КонечныйОстатокДт, 0) КАК " + СинонимРесурса + "КонечныйОстатокДт,
            |   ЕСТЬNULL(%ИмяТаблицы%ОстаткиПереопределяемый." + ИмяРесурса + "КонечныйОстатокКт, 0) КАК " + СинонимРесурса + "КонечныйОстатокКт" + Окончание;
            ТекстВыборРесурсыОбороты = ТекстВыборРесурсыОбороты + 
            "	%ИмяТаблицы%ОборотыПереопределяемый." + ИмяРесурса + "ОборотДт КАК " + СинонимРесурса + "ОборотДт,
            |	%ИмяТаблицы%ОборотыПереопределяемый." + ИмяРесурса + "ОборотКт КАК " + СинонимРесурса + "ОборотКт" + Окончание;
        КонецЕсли;    
	    	
	КонецЦикла;
	
	ПараметрПериодНачало = ?(ЭтоИсточник, "&НачалоПериода", "&НачалоПериодаПриемника {(&НачалоПериодаПриемника)}");
	ПараметрПериодКонец  = ?(ЭтоИсточник, "&КонецПериода", "&КонецПериодаПриемника {(&КонецПериодаПриемника)}");
	
	ТекстЗапроса = 
	"// %ВРЕМТАБЛ_2или4% - %ИмяТаблицы%ОстаткиПереопределяемый
    |ВЫБРАТЬ
    |   %ИмяТаблицы%ОстаткиПереопределяемый.Организация КАК Организация,
    |   %ИмяТаблицы%ОстаткиПереопределяемый.Счет КАК Счет" + ?(ЭтоИсточник, "Источника", "Приемника") + "ВТ,
        |%ВыборСубконтоОстатки%,
        |%ВыборРесурсыОстатки%    
    |ПОМЕСТИТЬ %ИмяТаблицы%Остатки
    |ИЗ
    |	РегистрБухгалтерии.%ИмяРегистра%.ОстаткиИОбороты("+ПараметрПериодНачало+", 
    |													"+ПараметрПериодКонец+", 
    |													Период, 
    |													, , , 
    |													Организация В (ВЫБРАТЬ СО.Организация ИЗ СоставОрганизаций КАК СО)
    |													) КАК %ИмяТаблицы%ОстаткиПереопределяемый
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |// %ВРЕМТАБЛ_3или5% - %ИмяТаблицы%ОборотыПереопределяемый
    |ВЫБРАТЬ
    |	%ИмяТаблицы%ОборотыПереопределяемый.Организация КАК Организация,
    |	%ИмяТаблицы%ОборотыПереопределяемый.Регистратор КАК Регистратор,
    |	%ИмяТаблицы%ОборотыПереопределяемый.Счет КАК Счет,
        |%ВыборСубконтоОбороты%,
        |%ВыборРесурсыОбороты%   
    |ПОМЕСТИТЬ %ИмяТаблицы%Обороты
    |ИЗ
    |	РегистрБухгалтерии.%ИмяРегистра%.Обороты(
    |			"+ПараметрПериодНачало+",
    |			"+ПараметрПериодКонец+",
    |			Регистратор,
    |			,
    |			,
    |			Организация В
    |				(ВЫБРАТЬ
    |					СО.Организация
    |				ИЗ
    |					СоставОрганизаций КАК СО),
    |			,
    |			) КАК %ИмяТаблицы%ОборотыПереопределяемый
    |
    |";    	          	    
       
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистра%", ИмяРегистра);
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыборСубконтоОстатки%", ТекстВыборСубконтоОстатки);
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыборСубконтоОбороты%", ТекстВыборСубконтоОбороты);
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыборРесурсыОстатки%", ТекстВыборРесурсыОстатки);
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВыборРесурсыОбороты%", ТекстВыборРесурсыОбороты);
    
    Если ЭтоИсточник Тогда
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВРЕМТАБЛ_2или4%", "ВРЕМТАБЛ_2");
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВРЕМТАБЛ_3или5%", "ВРЕМТАБЛ_3");
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяТаблицы%", "РегистрИсточник");
    Иначе	
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВРЕМТАБЛ_2или4%", "ВРЕМТАБЛ_4");
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВРЕМТАБЛ_3или5%", "ВРЕМТАБЛ_5");
        ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяТаблицы%", "РегистрПриемник");
    КонецЕсли;
    
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПривестиТипСубконтоСоответствияОборотов(ТекстЗапроса, ИсточникПриемник, ДтКт, НомерСубконто)
	
	НаименованиеСубконто = "СоответствиеОборотовПереопределяемый.Субконто" + ИсточникПриемник + ДтКт + НомерСубконто;
	ТекстПриведенногоТипа =
	"ВЫБОР
	|		КОГДА %1 ЕСТЬ NULL
	|				ИЛИ %1 В (&ПустыеСсылки)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ %1
	|	КОНЕЦ";
	ТекстПриведенногоТипа = СтрШаблон(ТекстПриведенногоТипа, НаименованиеСубконто);
	ТекстЗапроса          = СтрЗаменить(ТекстЗапроса, НаименованиеСубконто, ТекстПриведенногоТипа);
	
КонецПроцедуры

Функция СформироватьЗапрос(ПриводитьПустойТипКНеопределено)
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1;
	ТекстЗапроса = НаборДанных.Запрос;
	
	ИмяИсточника = ПравилаЗаполненияПолей.Источник.ИмяОбъекта;
	ИмяПриемника = ПравилаЗаполненияПолей.Приемник.ИмяОбъекта;
	
	МетаИсточник = Метаданные.РегистрыБухгалтерии[ИмяИсточника];
	МетаПриемник = Метаданные.РегистрыБухгалтерии[ИмяПриемника];
	
	ТекстЗапросаПоИсточнику = СформироватьТекстЗапросаПоРегистру(МетаИсточник, ИмяИсточника, Истина, ПриводитьПустойТипКНеопределено);
	ТекстДляЗамены = ПолучитьТекстПоМаркерам(ТекстЗапроса, "// Начало.ЗапросПоИсточнику", "// Конец.ЗапросПоИсточнику");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстДляЗамены, ТекстЗапросаПоИсточнику);
	
	ТекстЗапросаПоПриемнику = СформироватьТекстЗапросаПоРегистру(МетаПриемник, ИмяПриемника, Ложь, ПриводитьПустойТипКНеопределено);
	ТекстДляЗамены = ПолучитьТекстПоМаркерам(ТекстЗапроса, "// Начало.ЗапросПоПриемнику", "// Конец.ЗапросПоПриемнику");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстДляЗамены, ТекстЗапросаПоПриемнику);
	
	Если ПриводитьПустойТипКНеопределено Тогда
		Для НомерСубконто = 1 По 4 Цикл
			ПривестиТипСубконтоСоответствияОборотов(ТекстЗапроса, "Источника", "Дт", НомерСубконто);
			ПривестиТипСубконтоСоответствияОборотов(ТекстЗапроса, "Источника", "Кт", НомерСубконто);
			ПривестиТипСубконтоСоответствияОборотов(ТекстЗапроса, "Приемника", "Дт", НомерСубконто);
			ПривестиТипСубконтоСоответствияОборотов(ТекстЗапроса, "Приемника", "Кт", НомерСубконто);
		КонецЦикла;
	КонецЕсли;
	
	НаборДанных.Запрос = ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстПоМаркерам(Текст, МаркерНачало, МаркерКонец)
	
	ПозицияМаркерНачало = Найти(Текст, МаркерНачало) + СтрДлина(МаркерНачало);
	ПозицияМаркерКонец  = Найти(Текст, МаркерКонец);
	
	Возврат СокрЛП(Сред(Текст, ПозицияМаркерНачало, ПозицияМаркерКонец - ПозицияМаркерНачало - 1));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
